In [29]:
import pandas as pd 
import numpy as np

## 2.3 常用基本函数

In [30]:
df =pd.read_csv('data2/learn_pandas.csv')

df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer',
       'Test_Number', 'Test_Date', 'Time_Record'],
      dtype='object')

In [31]:
##取其中前七列作为数据样本
df = df[df.columns[:7]]
df

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N
...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N

### 2.3.1 汇总函数

head, tial 代表返回表或者序列的前n行或者后n行, 如果不写的话话则按照默认数量 5 返回

info,describe 分别返回表的 信息概况和表中数值列对应的主要统计量

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   School    200 non-null    object
 1   Grade     200 non-null    object
 2   Name      200 non-null    object
 3   Gender    200 non-null    object
 4   Height    183 non-null    float64
 5   Weight    189 non-null    float64
 6   Transfer  188 non-null    object
dtypes: float64(2), object(5)
memory usage: 11.1+ KB

In [33]:
df.describe()

           Height      Weight
count  183.000000  189.000000
mean   163.218033   55.015873
std      8.608879   12.824294
min    145.400000   34.000000
25%    157.150000   46.000000
50%    161.900000   51.000000
75%    167.500000   65.000000
max    193.900000   89.000000

### 2.3.2 特征统计函数

在 Series 和 DataFrame 上定义了许多统计函数，最常见的是 sum, mean, median, var, std, max, min 。例
如，选出身高和体重列进行演示：

In [34]:
df_demo = df[['Height','Weight']]
df_demo

     Height  Weight
0     158.9    46.0
1     166.5    70.0
2     188.9    89.0
3       NaN    41.0
4     174.0    74.0
..      ...     ...
195   153.9    46.0
196   160.9    50.0
197   153.9    45.0
198   175.3    71.0
199   155.7    51.0

[200 rows x 2 columns]

In [35]:
df_demo.mean()

Height    163.218033
Weight     55.015873
dtype: float64

In [36]:
df_demo.max()

Height    193.9
Weight     89.0
dtype: float64

需要介绍的时quantile,count,idxmax, 他们分别返回的时分位数,非缺失值个数,最大值对应的索引

In [37]:
df_demo.quantile(0.75)

Height    167.5
Weight     65.0
Name: 0.75, dtype: float64

In [38]:
df_demo.count()

Height    183
Weight    189
dtype: int64

In [39]:
df_demo.idxmax() # 同理 idxmin 是对应的最小值的索引

Height    193
Weight      2
dtype: int64

上面这些所有的函数，由于操作后返回的是标量，所以又称为聚合函数，它们有一个公共参数 axis ，默认为
0 代表逐列聚合，如果设置为 1 则表示逐行聚合：

In [40]:
df_demo.mean(axis=1).head() # 虽然可以这样写 但是在身高和体重这边逐行聚合没有意义

0    102.45
1    118.25
2    138.95
3     41.00
4    124.00
dtype: float64

### 2.3.3唯一值函数

对序列使用 unique 和 nunique 可以分别得到其唯一值组成的列表和唯一值的个数：

In [41]:
df['School'].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)

In [42]:
df['School'].nunique()

4

value_counts 可以得到唯一值和其对应出现的频数：

In [43]:
df['School'].value_counts()

School
Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: count, dtype: int64

如果想要观察多个列组合的唯一值，可以使用 drop_duplicates 。其中的关键参数是 keep ，默认值 first 表
示每个组合保留第一次出现的所在行，last 表示保留最后一次出现的所在行，False 表示把所有重复组合所
在的行剔除。

In [44]:
df_demo =df[['Gender','Transfer','Name']]

df_demo.drop_duplicates(['Gender','Transfer'])

    Gender Transfer            Name
0   Female        N    Gaopeng Yang
1     Male        N  Changqiang You
12  Female      NaN        Peng You
21    Male      NaN   Xiaopeng Shen
36    Male        Y    Xiaojuan Qin
43  Female        Y      Gaoli Feng

In [45]:
df_demo.drop_duplicates(['Gender','Transfer'],keep='last')

     Gender Transfer            Name
147    Male      NaN        Juan You
150    Male        Y   Chengpeng You
169  Female        Y   Chengquan Qin
194  Female      NaN     Yanmei Qian
197  Female        N  Chengqiang Chu
199    Male        N     Chunpeng Lv

In [46]:
df_demo.drop_duplicates(['Name','Gender'],keep=False).head() # 取前五个 只出现过一次的姓名和性别组合

   Gender Transfer            Name
0  Female        N    Gaopeng Yang
1    Male        N  Changqiang You
2    Male        N         Mei Sun
4    Male        N     Gaojuan You
5  Female        N     Xiaoli Qian

In [47]:
df['School'].drop_duplicates() # 在series上也能使用

0    Shanghai Jiao Tong University
1                Peking University
3                 Fudan University
5              Tsinghua University
Name: School, dtype: object

此外，duplicated 和 drop_duplicates 的功能类似，但前者返回了是否为唯一值的布尔列表，其 keep 参数与
后者一致。其返回的序列，把重复元素设为 True ，否则为 False 。drop_duplicates 等价于把 duplicated 为
True 的对应行剔除。

In [48]:
df_demo.duplicated(['Gender','Transfer']).head()

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [49]:
df['School'].duplicated().head()

0    False
1    False
2     True
3    False
4     True
Name: School, dtype: bool

### 2.3.4 替换函数
一般而言，替换操作是针对某一个列进行的，因此下面的例子都以 Series 举例。pandas 中的替换函数可以
归纳为三类：映射替换、逻辑替换、数值替换。其中映射替换包含 replace 方法、第八章中的 str.replace 方
法以及第九章中的 cat.codes 方法，此处介绍 replace 的用法。

在 replace 中，可以通过字典构造，或者传入两个列表来进行替换：

In [50]:
df['Gender'].replace({'Female':0,'Male':1}).head()

C:\Users\BT13657\AppData\Local\Temp\ipykernel_22500\589019225.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['Gender'].replace({'Female':0,'Male':1}).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [51]:
df['Gender'].replace(['Female','Male'],[0,1]).head()

C:\Users\BT13657\AppData\Local\Temp\ipykernel_22500\407978158.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['Gender'].replace(['Female','Male'],[0,1]).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

此外 replace还有另外一种特殊的方向替换,指定method参数为ffill 则用前面一个最近的未被踢换的值进行替换,bfill则使用后面最近的未被天的值进行替换,可以看下面的例子. 他们的结果时不一样的

In [52]:
s = pd.Series(['a', 1, 'b', 2, 1, 1, 'a',2,'c',1,1,1,'c'])

s.replace([1,2],method='ffill')

C:\Users\BT13657\AppData\Local\Temp\ipykernel_22500\1655508801.py:3: FutureWarning: The 'method' keyword in Series.replace is deprecated and will be removed in a future version.
  s.replace([1,2],method='ffill')

0     a
1     a
2     b
3     b
4     b
5     b
6     a
7     a
8     c
9     c
10    c
11    c
12    c
dtype: object

In [53]:
s.replace([1,2],method='bfill')

C:\Users\BT13657\AppData\Local\Temp\ipykernel_22500\977159017.py:1: FutureWarning: The 'method' keyword in Series.replace is deprecated and will be removed in a future version.
  s.replace([1,2],method='bfill')

0     a
1     b
2     b
3     a
4     a
5     a
6     a
7     c
8     c
9     c
10    c
11    c
12    c
dtype: object

正则替换请使用 str.replace

虽然对于 replace 而言可以使用正则替换，但是当前版本下对于 string 类型的正则替换还存在
bug ，因此如有此需求，请选择 str.replace 进行替换操作，具体的方式将在第八章中讲解。

逻辑替换包括了where和mask,这两个函数完全对称,当where函数在传入条件为False的对应行进行替换, 而mask则是再传入条件为True的对应行进行替换,当不指定替换值时,替换为缺失值.

In [54]:
s = pd.Series([1,2,2,1])

s.where(s==2,'not good') ## 判断为false是 进行替换

0    not good
1           2
2           2
3    not good
dtype: object

In [55]:
s.mask(s==2,'ok')

0     1
1    ok
2    ok
3     1
dtype: object

需要注意的是 传入条件只需是与被调用的Series索引一致的布尔序列即可

In [56]:
S_condition= pd.Series([True,False,False,True],index=s.index)

s.mask(S_condition,'ok')

0    ok
1     2
2     2
3    ok
dtype: object

数值替换包含了 round, abs, clip 方法，它们分别表示取整、取绝对值和截断：

In [57]:
s  = pd.Series([-1,1.2345,100,-50])

s.round(2) # 取整

0     -1.00
1      1.23
2    100.00
3    -50.00
dtype: float64

In [58]:
s.abs() # 取序列的绝对值

0      1.0000
1      1.2345
2    100.0000
3     50.0000
dtype: float64

In [61]:
s.clip(0,2) # 前两个数分别表示上下截断边界

0    0.0000
1    1.2345
2    2.0000
3    0.0000
dtype: float64

在 clip 中，超过边界的只能截断为边界值，如果要把超出边界的替换为自定义的值，应当如何做？

In [72]:
s2 = s.clip(0,2)

s3 = pd.Series(s2)

s3.mask(s3==0, -1)

0   -1.0000
1    1.2345
2    2.0000
3   -1.0000
dtype: float64